{
  "modelTopology": "Sequential",
  "config": {
    "name": "sequential_9",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 1, 14, 1],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "conv2d_9_input"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_9",
          "trainable": true,
          "dtype": "float32",
          "batch_input_shape": [null, 1, 14, 1],
          "filters": 32,
          "kernel_size": [1, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_9",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [1, 2],
          "padding": "valid",
          "strides": [1, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_10",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [1, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_10",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [1, 2],
          "padding": "valid",
          "strides": [1, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_11",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_11",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [1, 2],
          "padding": "valid",
          "strides": [1, 2],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten_3",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_9",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_10",
          "trainable": true,
          "dtype": "float32",
          "units": 128,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_11",
          "trainable": true,
          "dtype": "float32",
          "units": 2,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.13.1",
  "backend": "tensorflow",
  "weightsManifest": [
    {
      "paths": ["path_to_weights_for_conv2d_9_layer.h5"],
      "weights": [
        {
          "name": "conv2d_9/kernel:0",
          "shape": [1, 3, 1, 32],
          "dtype": "float32"
        },
        {
          "name": "conv2d_9/bias:0",
          "shape": [32],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["path_to_weights_for_conv2d_10_layer.h5"],
      "weights": [
        {
          "name": "conv2d_10/kernel:0",
          "shape": [1, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2d_10/bias:0",
          "shape": [64],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["path_to_weights_for_conv2d_11_layer.h5"],
      "weights": [
        {
          "name": "conv2d_11/kernel:0",
          "shape": [1, 3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "conv2d_11/bias:0",
          "shape": [128],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["path_to_weights_for_dense_9_layer.h5"],
      "weights": [
        {
          "name": "dense_9/kernel:0",
          "shape": [896, 256],
          "dtype": "float32"
        },
        {
          "name": "dense_9/bias:0",
          "shape": [256],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["path_to_weights_for_dense_10_layer.h5"],
      "weights": [
        {
          "name": "dense_10/kernel:0",
          "shape": [256, 128],
          "dtype": "float32"
        },
        {
          "name": "dense_10/bias:0",
          "shape": [128],
          "dtype": "float32"
        }
      ]
    },
    {
      "paths": ["path_to_weights_for_dense_11_layer.h5"],
      "weights": [
        {
          "name": "dense_11/kernel:0",
          "shape": [128, 2],
          "dtype": "float32"
        },
        {
          "name": "dense_11/bias:0",
          "shape": [2],
          "dtype": "float32"
        }
      ]
    }
  ]
}
